cmsis-svd/cmsis-svd/data/SiliconLabs/EFR32FG1P133F128GM48.svd
        <register>
          <name>IFS</name>
          <description>Interrupt Flag Set Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>EDGE</name>
              <description>Set EDGE Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WARMUP</name>
              <description>Set WARMUP Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APORTCONFLICT</name>
              <description>Set APORTCONFLICT Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFC</name>
          <description>Interrupt Flag Clear Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>EDGE</name>
              <description>Clear EDGE Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WARMUP</name>
              <description>Clear WARMUP Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APORTCONFLICT</name>
              <description>Clear APORTCONFLICT Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>EDGE</name>
              <description>EDGE Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WARMUP</name>
              <description>WARMUP Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTCONFLICT</name>
              <description>APORTCONFLICT Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APORTREQ</name>
          <description>APORT Request Status Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>APORT0XREQ</name>
              <description>1 If the Bus Connected to APORT0X is Requested</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT0YREQ</name>
              <description>1 If the Bus Connected to APORT0Y is Requested</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT1XREQ</name>
              <description>1 If the Bus Connected to APORT2X is Requested</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT1YREQ</name>
              <description>1 If the Bus Connected to APORT1X is Requested</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT2XREQ</name>
              <description>1 If the Bus Connected to APORT2X is Requested</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT2YREQ</name>
              <description>1 If the Bus Connected to APORT2Y is Requested</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT3XREQ</name>
              <description>1 If the Bus Connected to APORT3X is Requested</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT3YREQ</name>
              <description>1 If the Bus Connected to APORT3Y is Requested</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT4XREQ</name>
              <description>1 If the Bus Connected to APORT4X is Requested</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT4YREQ</name>
              <description>1 If the Bus Connected to APORT4Y is Requested</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APORTCONFLICT</name>
          <description>APORT Conflict Status Register</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>APORT0XCONFLICT</name>
              <description>1 If the Bus Connected to APORT0X is in Conflict With Another Peripheral</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT0YCONFLICT</name>
              <description>1 If the Bus Connected to APORT0Y is in Conflict With Another Peripheral</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT1XCONFLICT</name>
              <description>1 If the Bus Connected to APORT1X is in Conflict With Another Peripheral</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT1YCONFLICT</name>
              <description>1 If the Bus Connected to APORT1X is in Conflict With Another Peripheral</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT2XCONFLICT</name>
              <description>1 If the Bus Connected to APORT2X is in Conflict With Another Peripheral</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT2YCONFLICT</name>
              <description>1 If the Bus Connected to APORT2Y is in Conflict With Another Peripheral</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT3XCONFLICT</name>
              <description>1 If the Bus Connected to APORT3X is in Conflict With Another Peripheral</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT3YCONFLICT</name>
              <description>1 If the Bus Connected to APORT3Y is in Conflict With Another Peripheral</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT4XCONFLICT</name>
              <description>1 If the Bus Connected to APORT4X is in Conflict With Another Peripheral</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT4YCONFLICT</name>
              <description>1 If the Bus Connected to APORT4Y is in Conflict With Another Peripheral</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HYSTERESIS0</name>
          <description>Hysteresis 0 Register</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F3F000F</resetMask>
          <fields>
            <field>
              <name>HYST</name>
              <description>Hysteresis Select When ACMPOUT=0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HYST0</name>
                  <description>No hysteresis</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST1</name>
                  <description>14 mV hysteresis</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST2</name>
                  <description>25 mV hysteresis</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST3</name>
                  <description>30 mV hysteresis</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST4</name>
                  <description>35 mV hysteresis</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST5</name>
                  <description>39 mV hysteresis</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST6</name>
                  <description>42 mV hysteresis</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST7</name>
                  <description>45 mV hysteresis</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST8</name>
                  <description>No hysteresis</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST9</name>
                  <description>-14 mV hysteresis</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST10</name>
                  <description>-25 mV hysteresis</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST11</name>
                  <description>-30 mV hysteresis</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST12</name>
                  <description>-35 mV hysteresis</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST13</name>
                  <description>-39 mV hysteresis</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST14</name>
                  <description>-42 mV hysteresis</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST15</name>
                  <description>-45 mV hysteresis</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVVA</name>
              <description>Divider for VA Voltage When ACMPOUT=0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVVB</name>
              <description>Divider for VB Voltage When ACMPOUT=0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HYSTERESIS1</name>
          <description>Hysteresis 1 Register</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F3F000F</resetMask>
          <fields>
            <field>
              <name>HYST</name>
              <description>Hysteresis Select When ACMPOUT=1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HYST0</name>
                  <description>No hysteresis</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST1</name>
                  <description>14 mV hysteresis</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST2</name>
                  <description>25 mV hysteresis</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST3</name>
                  <description>30 mV hysteresis</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST4</name>
                  <description>35 mV hysteresis</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST5</name>
                  <description>39 mV hysteresis</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST6</name>
                  <description>42 mV hysteresis</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST7</name>
                  <description>45 mV hysteresis</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST8</name>
                  <description>No hysteresis</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST9</name>
                  <description>-14 mV hysteresis</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST10</name>
                  <description>-25 mV hysteresis</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST11</name>
                  <description>-30 mV hysteresis</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST12</name>
                  <description>-35 mV hysteresis</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST13</name>
                  <description>-39 mV hysteresis</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST14</name>
                  <description>-42 mV hysteresis</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST15</name>
                  <description>-45 mV hysteresis</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVVA</name>
              <description>Divider for VA Voltage When ACMPOUT=1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVVB</name>
              <description>Divider for VB Voltage When ACMPOUT=1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROUTEPEN</name>
          <description>I/O Routing Pine Enable Register</description>
          <addressOffset>0x040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>OUTPEN</name>
              <description>ACMP Output Pin Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
